; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?x ?y)
		(car ?c)
		(location ?l)
		(at-ferry ?l)
		(at ?c ?l)
		(empty-ferry)
		(on ?c))

   (:action sail
       :parameters  (?from ?to)
       :precondition (and (not-eq ?from ?to) 
                          (location ?from) (location ?to) (at-ferry ?from))
       :effect (and  (at-ferry ?to)
		     (not (at-ferry ?from))))


   (:action board
       :parameters (?car ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car  ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (on ?car) (at-ferry ?loc))
       :effect (and (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-l5-c2)
(:domain ferry)
(:objects l0 l1 l2 l3 l4 
          c0 c1 
)
(:init
(location l0)
(location l1)
(location l2)
(location l3)
(location l4)
(car c0)
(car c1)
(not-eq l0 l1)
(not-eq l1 l0)
(not-eq l0 l2)
(not-eq l2 l0)
(not-eq l0 l3)
(not-eq l3 l0)
(not-eq l0 l4)
(not-eq l4 l0)
(not-eq l1 l2)
(not-eq l2 l1)
(not-eq l1 l3)
(not-eq l3 l1)
(not-eq l1 l4)
(not-eq l4 l1)
(not-eq l2 l3)
(not-eq l3 l2)
(not-eq l2 l4)
(not-eq l4 l2)
(not-eq l3 l4)
(not-eq l4 l3)
(empty-ferry)
(at c0 l3)
(at c1 l0)
(at-ferry l2)
)
(:goal
(and
(at c0 l4)
(at c1 l1)
)
)

(:constraints
  (and
    (sometime-before (at c1 l1) (at c0 l4))
    (always (not (at c0 l0)))
    (always (not (at c0 l1)))
    (always (not (at c0 l2)))
    (always (not (at c1 l2)))
    (always (not (at c1 l3)))
    (always (not (at c1 l4)))
  )
)
)

; plan
1. (sail l2 l4)
   deleted: (at-ferry l2)
   added: (at-ferry l4)
   goals met: 0 of 2
2. (sail l4 l3)
   deleted: (at-ferry l4)
   added: (at-ferry l3)
   goals met: 0 of 2
3. (board c0 l3)
   deleted: (at c0 l3) (empty-ferry)
   added: (on c0)
   goals met: 0 of 2
4. (sail l3 l4)
   deleted: (at-ferry l3)
   added: (at-ferry l4)
   goals met: 0 of 2
5. (debark c0 l4)
   deleted: (on c0)
   added: (at c0 l4) (empty-ferry)
   goals met: 1 of 2
6. (sail l4 l1)
   deleted: (at-ferry l4)
   added: (at-ferry l1)
   goals met: 1 of 2
7. (sail l1 l0)
   deleted: (at-ferry l1)
   added: (at-ferry l0)
   goals met: 1 of 2
8. (board c1 l0)
   deleted: (at c1 l0) (empty-ferry)
   added: (on c1)
   goals met: 1 of 2
9. (sail l0 l1)
   deleted: (at-ferry l0)
   added: (at-ferry l1)
   goals met: 1 of 2
10. (debark c1 l1)
   deleted: (on c1)
   added: (at c1 l1) (empty-ferry)
   goals met: 2 of 2
